Repository: MaestriHub/localization
Catalog: IOS/Localizable.xcstrings
Source language: en
Languages: ru

# error.http.badRequest
source: 400 Bad Request: The server could not understand the request due to invalid syntax.
ru: 400 Неправильный запрос: Сервер не понимает запрос из-за неверного синтаксиса.

# error.http.conflict
source: 409 Conflict: The request could not be processed because of conflict in the request, such as an edit conflict between multiple simultaneous updates.
ru: 409 Конфликт: Запрос не может быть обработан из-за конфликта в запросе, например, конфликта редактирования между несколькими одновременными обновлениями.

# error.http.error
source: Error
ru: Ошибка

# error.http.forbidden
source: 403 Forbidden: The server understands the request, but refuses to authorize it. Usually due to lack of access rights.
ru: 403 Запрещено: У сервера есть понимание запроса, но он отказывается его выполнить. Обычно это связано с отсутствием прав доступа.

# error.http.gatewayTimeout
source: 504 Gateway Timeout: The server, acting as a gateway or proxy, did not receive a timely response from the upstream server.
ru: 504 Шлюз не отвечает: Сервер, действующий как шлюз или прокси, не получил своевременный ответ от вышестоящего сервера.

# error.http.internalServerError
source: 500 Internal Server Error: A generic error message. Typically means something went wrong on the server's side.
ru: 500 Внутренняя ошибка сервера: Общая ошибка сервера. Обычно означает, что что-то пошло не так на стороне сервера.

# error.http.methodNotAllowed
source: 405 Method Not Allowed: The method specified in the request is not allowed for the resource.
ru: 405 Метод не разрешен: Метод, указанный в запросе, запрещен для данного ресурса.

# error.http.notFound
source: 404 Not Found: The server can't find the requested resource. The most common error indicating a non-existent page.
ru: 404 Не найдено: Сервер не может найти запрашиваемый ресурс. Это самая распространенная ошибка, указывающая на несуществующую страницу.

# error.http.serviceUnavailable
source: 503 Service Unavailable: The server is not ready to handle the request due to temporary overload or maintenance.
ru: 503 Сервис недоступен: Сервер не может обработать запрос из-за временной перегрузки или обслуживания.

# error.http.unauthorized
source: 401 Unauthorized: Authentication is required. The user must log in to access.
ru: 401 Неавторизован: Требуется аутентификация. Пользователь должен залогиниться для доступа.

# error.procedure.missingDuration
source: There was an issue with the procedure duration. Please try again. If the problem persists, contact support and mention error code: missingDuration
ru: Произошла ошибка с длительностью процедуры. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingDuration

# error.procedure.missingMaster
source: There was an issue with assigning a master to the procedure. Please try again. If the problem persists, contact support and mention error code: missingMaster
ru: Произошла ошибка при назначении мастера для процедуры. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingMaster

# error.procedure.missingPrice
source: There was an issue with the procedure price. Please try again. If the problem persists, contact support and mention error code: missingPrice
ru: Произошла ошибка с ценой процедуры. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingPrice

# error.procedure.missingServiceId
source: There was an issue with the service ID for the procedure. Please try again. If the problem persists, contact support and mention error code: missingServiceId
ru: Произошла ошибка с идентификатором услуги. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingServiceId

# error.salon.missingAddress
source: There was an issue with the salon address. Please try again. If the problem persists, contact support and mention error code: missingAddress
ru: Произошла ошибка с адресом салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingAddress

# error.salon.missingLocale
source: There was an issue with the salon locale. Please try again. If the problem persists, contact support and mention error code: missingLocale
ru: Произошла ошибка с локализацией салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingLocale

# error.salon.missingName
source: There was an issue with the salon name. Please try again. If the problem persists, contact support and mention error code: missingName
ru: Произошла ошибка с названием салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingName

# error.salon.missingTimetable
source: There was an issue with the salon timetable. Please try again. If the problem persists, contact support and mention error code: missingTimetable
ru: Произошла ошибка с расписанием салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingTimetable

# error.salon.missingTimeZone
source: There was an issue with the salon time zone. Please try again. If the problem persists, contact support and mention error code: missingTimeZone
ru: Произошла ошибка с часовым поясом салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingTimeZone

# error.salon.missingType
source: There was an issue with the salon type. Please try again. If the problem persists, contact support and mention error code: missingType
ru: Произошла ошибка с типом салона. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingType

# error.service.missingCategory
source: There was an issue with the service category. Please try again. If the problem persists, contact support and mention error code: missingCategory
ru: Возникла проблема с категорией услуг. Попробуйте еще раз. Если проблема не исчезнет, ​​обратитесь в службу поддержки и укажите код ошибки: missingCategory

# error.service.missingDescription
source: There was an issue with the service description. Please try again. If the problem persists, contact support and mention error code: missingDescription
ru: Произошла ошибка с описанием услуги. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingDescription

# error.service.missingTitle
source: There was an issue with the service title. Please try again. If the problem persists, contact support and mention error code: missingTitle
ru: Произошла ошибка с названием услуги. Пожалуйста, попробуйте еще раз. Если проблема не устранена, обратитесь в поддержку и укажите код ошибки: missingTitle

# feedback.banners.accent
source: Leave
ru: Оставьте

# feedback.banners.subtitle
source: Leave a review about the application or any feedback
ru: Оставьте отзыв о приложении или любую обратную связь

# feedback.banners.title
source: Help us improve!
ru: Помогите нам стать лучше!

# full_schedule.screen.cancel
source: Сancel
ru: Отмена

# full_schedule.screen.edit
source: Edit %lld
ru: Редактировать %lld

# full_schedule.screen.salonSchedule
source: Salon schedule
ru: График салона

# full_schedule.screen.select_masters
source: Select masters
ru: Выбрать мастеров

# fullProcedure.widget.title
source: Select a master
ru: Выберите мастера

# iAm.widget.customer
source: Customer
ru: Клиент

# iAm.widget.customer_register
source: Register like customer
ru: Зарегистрируйтесь как клиент

# iAm.widget.professional
source: Professional
ru: Мастер

# iAm.widget.professional_register
source: Register like professional
ru: Зарегистрируйтесь как мастер

# iAm.widget.title
source: Select mode
ru: Выберите режим

# list_appointments.screen.switch_button
source: Diary
ru: Дневник

# main_customer.mapButton.title
source: Map
ru: Карта

# main_customer.screen.map_button
source: Map
ru: Карта

# main.title
source: Main
ru: Главная

# mainCustomer.screen.favorites
source: Favorites
ru: Избранное

# mainCustomer.screen.footer_subtitle
source: View
ru: Открыть

# mainCustomer.screen.footer_title
source: History
ru: История

# mainCustomer.screen.my_notes
source: My notes
ru: Мои записи

# mainCustomer.screen.no_appointments
source: You have no appointments
ru: У тебя нет записей

# mainCustomer.screen.no_favorites
source: You have no favorites
ru: У тебя нет избранных

# mainCustomer.screen.no_salons
source: There are no salons nearby
ru: Нет салонов поблизости

# mainCustomer.screen.salons
source: Salons
ru: Салоны

# map.screen.search_button
source: Search in this region
ru: Искать в этом регионе

# map.screen.search_button_warning
source: Need to zoom in to search
ru: Нужно увеличить масштаб для поиска

# master_dangerZone.widget.cancel
source: Cancel
ru: Отмена

# master_dangerZone.widget.cancel_hint
source: The master will not be able to join via the link
ru: Мастер не сможет присоединиться по ссылке

# master_dangerZone.widget.cancel_message_alert
source: The master will not be able to join via the link
ru: Мастер не сможет присоединиться по ссылке

# master_dangerZone.widget.cancel_title
source: Cancel invitation
ru: Отменить приглашение

# master_dangerZone.widget.cancel_title_alert
source: Confirm cancellation
ru: Подтвердить отмену

# master_dangerZone.widget.deactivate
source: Deactivate
ru: Деактивировать

# master_dangerZone.widget.deactivate_title
source: Deactivate master
ru: Деактивировать мастер

# master_dangerZone.widget.delete
source: Delete
ru: Удалить

# master_dangerZone.widget.fire
source: Fire
ru: Уволить

# master_dangerZone.widget.fire_an_employee
source: Fire an employee
ru: Уволить сотрудника

# master_dangerZone.widget.master_deactivate_message
source: Deactivate master to hide him from available
ru: Деактивируйте мастера, чтобы скрыть его из доступных

# master_dangerZone.widget.master_deactivate_message_alert
source: Are you sure you want to deactivate the master?
ru: Вы уверены, что хотите деактивировать мастера?

# master_dangerZone.widget.master_delete_message_alert
source: To confirm, enter the name of the master in the field below
ru: Для подтверждения введите имя мастера в поле ниже

# master_dangerZone.widget.master_delete_title_alert
source: The action cannot be undone. Are you sure you want to delete?
ru: Действие невозможно отменить. Вы уверены, что хотите удалить?

# master_dangerZone.widget.title
source: Danger Zone
ru: Опасная зона

# master.all.action
source: Invite master
ru: Пригласить мастера

# master.all.title
source: All Masters
ru: Все мастера

# master.creatable.add_conact
source: Add contact
ru: Добавить контакт

# master.creatable.choosePosition
source: Select a position
ru: Выберите должность

# master.creatable.create_button
source: Create
ru: Создать

# master.creatable.description_placeholder
source: Description
ru: Описание

# master.creatable.enter_master_description
source: Please give a description of the master
ru: Дайте пожалуйста характеристику мастеру

# master.creatable.invitation_link
source: Send invitation link
ru: Отправить ссылку-приглашение

# master.creatable.more_contact
source: Want to add another method of communication?
ru: Хотите добавить еще один способ связи?

# master.creatable.setup_schedule
source: You can customize the work schedule of the invited master
ru: Вы можете настроить график работы приглашенного мастера

# master.creatable.successfully_created
source: Congratulations, you have successfully created an invitation for a new master
ru: Поздравляем, вы успешно создали приглашение для нового мастера.

# master.creatable.title
source: Master
ru: Мастер

# master.screen.all_action
source: Invite master
ru: Пригласить мастера

# master.screen.all_title
source: All Masters
ru: Все мастера

# master.screen.invite_link
source: Invitate link
ru: Ссылка для приглашения

# master.screen.new_master
source: New master
ru: Новый мастер

# master.widget.action
source: Invite master
ru: Пригласить мастера

# master.widget.all_action
source: Invite master
ru: Пригласить мастера

# master.widget.all_title
source: All Masters
ru: Все мастера

# master.widget.link
source: All
ru: Все

# master.widget.singleMaster
source: Master
ru: Мастер

# master.widget.title
source: Masters
ru: Мастера

# master.widget.type_master
source: Master
ru: Мастер

# masters.screen.positions
source: Positions
ru: Должности

# masters.sheet.title
source: Masters
ru: Мастера

# masters.sheet.unknown
source: Unknown
ru: Неизвестно

# not_chosen.screen.create_customer_button
source: Customer
ru: Клиент

# not_chosen.screen.create_professional_button
source: Professional
ru: Мастер

# not_chosen.screen.main_place_holder
source: Choose the role to finish registration
ru: Выберите роль чтобы закончить регистрацию

# notice.title
source: Notifications
ru: Уведомления

# Permissions.appointments
source: Access to appointments
ru: Доступ к записям

# Permissions.contact
source: Access to contact
ru: Доступ к контактам

# Permissions.employee
source: Access to employee
ru: Доступ к сотрудникам

# Permissions.finance
source: Access to finance
ru: Доступ к финансам

# Permissions.notifications
source: Access to notifications
ru: Доступ к уведомлениям

# Permissions.owner
source: Owner
ru: Владелец

# Permissions.position
source: Access to position
ru: Доступ к должностям

# Permissions.procedure
source: Access to procedure
ru: Доступ к процедурам

# Permissions.salary
source: Access to salary
ru: Доступ к зарплатам

# Permissions.salon
source: Access to salon
ru: Доступ к салонам

# permissions.sheet.action
source: Save
ru: Сохранить

# permissions.sheet.selectAll
source: Select all
ru: Выбрать все

# permissions.sheet.title
source: Accesses
ru: Доступы

# Permissions.statistic
source: Access to statistic
ru: Доступ к статистике

# Permissions.timetable
source: Access to timetable
ru: Доступ к расписанию

# Permissions.widget.isEmpty
source: Permissions is empty
ru: Доступы не добавлены

# Permissions.widget.link
source: Edit
ru: Редактировать

# Permissions.widget.title
source: Permissions
ru: Разрешения

# position.creatable.addPermissions
source: Set permissions for this position
ru: Установить разрешения для этой позиции

# position.creatable.click_create
source: To save, click Create
ru: Что бы сохранить, нажмите создать

# position.creatable.create_button
source: Create
ru: Создать

# position.creatable.enter_position_name
source: Enter position name
ru: Введите название должности

# position.creatable.permissionsIsEmpty
source: Permissions not added
ru: Разрешения не добавлены

# position.creatable.placeholder
source: Enter position
ru: Введите должность

# position.creatable.setSalaryIsEmpty
source: Payment terms not added
ru: Условия оплаты не добавлены

# position.creatable.settingSalary
source: Set the salary amount for this position
ru: Установить размер заработной платы для этой должности

# position.creatable.title
source: Position
ru: Должность

# position.screen.add_position
source: Add position
ru: Добавить должность

# position.screen.not_found
source: Not found
ru: Не найдено

# position.screen.title
source: Positions
ru: Должность

# PositionDangerZone.widget.cancel
source: Cancel
ru: Отмена

# PositionDangerZone.widget.delete
source: Delete
ru: Удалить

# PositionDangerZone.widget.delete_hint
source: Action cannot be undone
ru: Действие не может быть отменено

# PositionDangerZone.widget.delete_title
source: Delete Position
ru: Удалить должность

# PositionDangerZone.widget.delete_title_alert
source: The action cannot be undone. Are you sure you want to delete?
ru: Действие не может быть отменено. Вы уверены, что хотите удалить?

# PositionDangerZone.widget.delete_title_message
source: Confirm deletion
ru: Подтвердите удаление

# PositionDangerZone.widget.title
source: Danger Zone
ru: Опасная зона

# Positions.sheet.createPosition
source: Create new position
ru: Создать новую должность

# Positions.sheet.not_found
source: Not found
ru: Не найдено

# Positions.widget.alertTitle
source: Confirm deleting the position
ru: Подтвердите удаление должности

# Positions.widget.cancelAlertButton
source: Cancel
ru: Отмена

# Positions.widget.deleteAlertButton
source: Delete
ru: Удалить

# Positions.widget.link
source: Show all
ru: Показать все

# Positions.widget.positionsIsEmpty
source: No positions available
ru: Должности не найдены

# Positions.widget.title
source: Positions
ru: Должность

# Positions.widget.widget_button
source: Add new position
ru: Добавить должность

# proc.all.action
source: Add procedure
ru: Добавить процедуру

# proc.all.title
source: All Procedures
ru: Все процедуры

# proc.screen.all_action
source: Add procedure
ru: Добавить процедуру

# proc.screen.title
source: All Procedures
ru: Все процедуры

# proc.widget.action
source: Add procedure
ru: Добавить процедуру

# proc.widget.link
source: All
ru: Все

# proc.widget.title
source: Services
ru: Процедуры

# procedure_cell.widget.delete
source: Delete
ru: Удалить

# procedure_cell.widget.edit
source: Edit
ru: Редактировать

# procedure_cell.widget.info
source: Info
ru: Информация

# procedure_update.creatable.alias_step_placeholder
source: New procedure alias
ru: Новое название процедуры

# procedure_update.creatable.enter_new_alias
source: Enter a new procedure alias
ru: Введите новое название процедуры

# procedure_update.creatable.title
source: Editing the procedure
ru: Редактирование

# procedure.creatable.alias
source: If you want this service to appear in your profile under a custom name, you can suggest your own personalized title for it
ru: Если вы хотите, чтобы эта услуга отображалась в вашем профиле под индивидуальным названием, вы можете предложить свое собственное название для нее

# procedure.creatable.click_create
source: To save, click Create
ru: Чтобы сохранить, нажмите Создать

# procedure.creatable.create_button
source: Create
ru: Создать

# procedure.creatable.enter_procedure_description
source: Please describe the details of the procedure. Example: “Bring a towel, arrive 10-15 minutes earlier, remove jewelry, inform about contraindications”
ru: Опишите особенности процедуры. Пример: "Принести полотенце, прибыть за 10-15 минут, снять украшения, сообщить о противопоказаниях"

# procedure.creatable.placeholder
source: Enter procedure name
ru: Введите название процедуры

# procedure.creatable.procedure_cost
source: Please indicate the cost of the procedure
ru: Укажите стоимость процедуры

# procedure.creatable.procedure_duration
source: Specify the duration of the procedure
ru: Укажите продолжительность процедуры

# procedure.creatable.select_category
source: Select a category
ru: Выберите категорию

# procedure.creatable.select_procedure
source: Enter the name of the procedure or select from the list provided
ru: Введите название процедуры или выберите из предложенного списка

# procedure.creatable.select_procedure_info
source: Choosing an existing option will make it easier for others to find you in search
ru: Если вы выберете один из существующих вариантов, клиентам будет проще вас найти

# procedure.creatable.title
source: Procedure
ru: Процедура

# procedure.screen.alert_title
source: Are you sure you want to delete
ru: Вы уверены, что хотите удалить

# procedure.screen.cancel
source: Cancel
ru: Отмена

# procedure.screen.delete
source: Delete
ru: Удалить

# procedure.screen.select
source: Select
ru: Выбрать

# professional.creatable.click_continue
source: Press 'Continue' to become a Master
ru: Нажмите 'Продолжить', чтобы стать Мастером

# professional.creatable.continue_button
source: Continue
ru: Продолжить

# professional.creatable.create_another_salon
source: You can also create another salon
ru: Вы также можете добавить еще один салон

# professional.creatable.create_first_salon
source: You can create your first salon
ru: Вы можете создать свой первый салон

# professional.creatable.create_salon_button
source: Create salon
ru: Создать салон

# professional.creatable.invitation_link
source: "If you have an invitation link, please enter it below
ru: Если у вас есть ссылка-приглашение, пожалуйста, введите её ниже

# professional.creatable.link_is_not_valid
source: Unfortunately, the entered link is invalid. Please double-check and enter it again
ru: К сожалению, введённая ссылка недействительна. Пожалуйста, проверьте и введите её снова

# professional.creatable.title
source: Professional setup
ru: Регистрация мастера

# professional.screen.add_new_salon_button
source: Add new salon
ru: Добавить новый салон

# profile_update.creatable.enter_name
source: Enter new nickname
ru: Введите новый никнейм

# profile_update.creatable.placeholder
source: Name
ru: Имя

# profile_update.creatable.save
source: Save
ru: Сохранить

# profile_update.creatable.title
source: Editing your profile
ru: Обновление профиля

# profile_update.creatable.upload_avatar
source: Upload a new avatar
ru: Загрузите новый аватар

# profile.appIcon.title
source: Select App Icon
ru: Выберите иконку приложения

# profile.danger.delete.action
source: Delete
ru: Удалить

# profile.danger.delete.hint
source: This action cannot be undone
ru: Действие нельзя будет отменить

# profile.danger.delete.title
source: Delete User
ru: Удалить пользователя

# profile.danger.logout.action
source: Logout
ru: Выйти

# profile.danger.logout.title
source: Logout
ru: Выход

# profile.danger.title
source: Danger Zone
ru: Опасная зона

# profile.screen.title
source: Profile
ru: Профиль

# profile.subscription.activate
source: Activate Subscription
ru: Активировать подписку

# profile.subscription.cancel
source: Cancel Subscription
ru: Отменить подписку

# profile.subscription.subtitle
source: Subscription valid until %@
ru: Подписка действует до %@

# profile.subscription.title
source: Subscription
ru: Подписка

# public.screen.login
source: Login
ru: Войти

# public.screen.map_button
source: Map
ru: Карта

# public.screen.not_found
source: Not found
ru: Не найдено

# Salary.dailyWage
source: Daily Wage
ru: Ежедневный оклад

# Salary.hourlyWage
source: Hourly Wage
ru: Почасовая оплата

# Salary.individalRate
source: Individual rate for the work performed
ru: Индивидуальная ставка за выполненную работу

# Salary.monthlyWage
source: Monthly Wage
ru: Ежемесячный оклад

# Salary.notAdded
source: Conditions not added
ru: Условия не добавлены

# Salary.profitPercentage
source: Profit percentage
ru: Процент от прибыли

# Salary.sheet.action
source: Save
ru: Сохранить

# Salary.sheet.alertTitle
source: Enter a new value
ru: Введите новое значение

# Salary.sheet.cancel
source: Cancel
ru: Отмена

# Salary.sheet.delete
source: Delete
ru: Удалить

# Salary.sheet.ok
source: Ok
ru: Ок

# Salary.sheet.percentageOfProfit
source: Percentage of profit
ru: Процент от прибыли

# Salary.sheet.percentWidgetTitle
source: Percent
ru: Процент

# Salary.sheet.pieceworkWidgetTitle
source: Piece-work payment
ru: Оплата за выполнению работу

# Salary.sheet.salaryWidgetAction
source: Add condition
ru: Добавить условие

# Salary.sheet.selectType
source: Select type
ru: Выберите тип

# Salary.sheet.title
source: Setting salaries
ru: Настройка зарплаты

# Salary.sheet.wageWidgetTitle
source: Fixed payment
ru: Оклад

# Salary.widget.link
source: Edit
ru: Редактировать

# Salary.widget.title
source: Salary conditions
ru: Условия оплаты труда

# Salary.widget.widget_button
source: Add new condition
ru: Добавить новое условие

# salon_danger_zone.widget.activate
source: Activate
ru: Активировать

# salon_danger_zone.widget.activate_hint
source: Restore salon operations
ru: Восстановить работу салона

# salon_danger_zone.widget.activate_title
source: Activate Salon
ru: Активировать салон
